[
    {
    "input": ["Patient: Doctor, I started a new medication yesterday, and since then, I have been feeling terrible.\nDoctor: I’m sorry to hear that. Can you tell me more about your symptoms?\nPatient: Yes, I have red rashes all over my arms and legs, and it’s so itchy. I also feel a burning sensation when I urinate.\nDoctor: I see. Did you experience any other symptoms like stomach pain, vomiting, or any swelling?\nPatient: No vomiting, but I did have some mild stomach pain this morning.\nDoctor: Based on what you’ve described — skin rash, itching, burning sensation during urination, and stomach pain — it sounds like you may be experiencing a Drug Reaction.\nPatient: Oh no! Is it serious?\nDoctor: It can be managed if addressed early. I recommend you stop taking the medication immediately and visit the hospital if symptoms persist. I’ll also provide some medication to reduce the itching.\nPatient: Thank you, doctor.","Patient: Doctor, I think I’m having a reaction to the medicine I took for my cold. Doctor: What symptoms are you experiencing?Patient: My whole body is itching, and I have these red, bumpy rashes on my chest and back.Doctor: Have you noticed any pain in your stomach, nausea, or burning sensation while urinating?Patient: No burning, but I do feel some discomfort in my stomach.Doctor: From your symptoms — itching, red rashes, and stomach discomfort — it seems to be a Drug Reaction. Have you stopped taking the medication?Patient: No, I thought it was just normal.Doctor: Stop the medication right away and monitor your symptoms. I’ll prescribe something to manage the rash and stomach discomfort.Patient: Got it, doctor. I’ll stop it immediately."],
    "output":"Drug Reaction"
    },{
        "input": ["Patient: Doctor, I’ve been feeling terrible for the last few days.Doctor: I’m sorry to hear that. Can you describe your symptoms? Patient: I’ve had constant chills, high fever, and headaches. I feel weak, and I sweat a lot at night. Doctor: Do you have any vomiting or nausea? Patient: Yes, I vomited twice yesterday, and I feel nauseous most of the day. Doctor: These are classic symptoms of Malaria. Have you been in an area where mosquitoes are common? Patient: Yes, I just got back from a trip to a village. Doctor: That explains it. I’ll run some tests to confirm it, but I believe it’s Malaria. We’ll start treatment right away. Patient: Thank you, doctor.","Patient: Doctor, I have a severe headache and high fever.Doctor: I see. Any other symptoms like chills, nausea, orsweating?Patient: Yes, I had chills last night, and I keep feelinglike I’m going to vomit. I’ve also been sweating a lot.Doctor: Have you been exposed to mosquitoes recently?Patient: Yes, I went camping last week.Doctor: Given your symptoms — fever, chills, vomiting, andsweating — it looks like you might have Malaria. I’ll ordera blood test to confirm it.Patient: Oh no! Is it treatable?Doctor: Yes, it’s treatable. Once the test confirms it,we’ll start you on anti-malarial medication right away."],
        "output":"Malaria"
    },{
        "input":["Patient: Doctor, my eyes are watery, and I can’t stop sneezing.Doctor: Did you come into contact with dust, pollen, or petdander recently?Patient: Yes, I visited a park with lots of flowersyesterday.Doctor: It sounds like you have an Allergy to pollen. Do youhave any swelling or itching?Patient: My nose itches a lot, and my throat feels scratchytoo.Doctor: That confirms it. I’ll prescribe an antihistamine torelieve the sneezing and itching.Patient: Thank you, doctor.","Patient: Doctor, my face and hands have started swelling suddenly.Doctor: Have you eaten any new food or come into contactwith any animals?Patient: I ate seafood at a restaurant last night.Doctor: It looks like you’re having an Allergic Reaction toseafood. Do you have difficulty breathing?Patient: No, but my face is really swollen.Doctor: I’ll prescribe an anti-allergy medication. If younotice any difficulty breathing, call emergency servicesimmediately."],
        "output":"Allergy"
    },
    {
        "input":["Patient: Doctor, I have terrible knee pain, and it’s been getting worse over the months.Doctor: Does the pain get worse after physical activity orduring cold weather?Patient: Yes, especially after walking or standing for along time.Doctor: Do you feel any stiffness when you wake up in themorning?Patient: Yes, my knees feel stiff, but it gets better aftera while.Doctor: These symptoms are typical of Osteoarthritis. I’llrecommend lifestyle changes, pain relievers, andphysiotherapy.","Patient: Doctor, my fingers have become stiff, and I can’t open jars easily anymore.Doctor: Do you feel pain in your fingers after working forlong periods?Patient: Yes, and I feel stiffness in the morning as well.Doctor: It sounds like Osteoarthritis in your fingers. I’llsuggest exercises, and we can discuss pain managementoptions."],
        "output":"Osteoarthritis"
    },
    {
        "input":["Patient: Doctor, I’ve been coughing for weeks, and sometimes I see blood in my sputum.Doctor: That sounds concerning. Do you also have nightsweats or unexplained weight loss?Patient: Yes, I’ve lost a lot of weight recently, and Isweat a lot at night.Doctor: Based on the persistent cough, weight loss, andnight sweats, it’s possible you have Tuberculosis (TB). I’llschedule a chest X-ray and a sputum test to confirm.","Patient: Doctor, I’ve had a chronic cough for weeks and shortness of breath.Doctor: Any weight loss or night sweats?Patient: Yes, I lost about 5 kg, and I wake up drenched insweat.Doctor: Given your symptoms, I suspect Tuberculosis (TB).We’ll run some tests to confirm and start treatment rightaway."],
        "output":"Tuberculosis"
    },
    {
        "input":["Patient: Doctor, I feel dizzy often, and my head feels heavy.Doctor: Have you checked your blood pressure recently?Patient: No, I haven’t.Doctor: I’ll check it now. Your blood pressure is 160/100,which is high. You have Hypertension. I’ll prescribemedication and suggest lifestyle changes.","Patient: Doctor, I get severe headaches in the morning.Doctor: Do you feel dizzy or have vision problems?Patient: Yes, I feel dizzy after standing up too quickly.Doctor: These are signs of Hypertension. I’ll prescribemedication and advise dietary changes"],
        "output":"Hypertension"
    },
    {
        "input":["Patient: Doctor, I’ve had a high fever for 5 days, and I feel extremely weak.Doctor: Have you had diarrhea or constipation?Patient: I’ve had constipation, and I feel tired all thetime.Doctor: These symptoms point to Typhoid Fever. We’ll do ablood test to confirm it.","Patient: Doctor, I feel so weak and my fever won't go away.Doctor: Do you have any other symptoms like stomach pain orconstipation?Patient: Yes, I have both.Doctor: These signs are typical of Typhoid Fever. I’llrecommend a Widal test to confirm it."],
        "output":"Typhoid"
    }
]
